'''
在int范围内：Z∈[1,2147483647]
计算正整数的平方根并保留四位小数
'''

def int_sqrt(input):
    #放大输入值，输出为x
    x = input
    if 1 <= input < 10:
        x *= 100000000
    elif 10 <= input < 1000:
        x *= 1000000
    elif 1000 <= input < 100000:
        x *= 10000
    elif 100000 <= input < 10000000:
        x *= 100

    #线性估初值+牛顿迭代法计算开方整数部分，输出为y
    y = x
    y = y // 32768 + 2456
    y = (x // y + y) // 2
    y = (x // y + y) // 2
    y = (x // y + y) // 2
    if y > x // y:  #保证输出值始终不大于真实结果
        y -= 1

    #估值公式，估计平方根小数部分，输出为m
    m = (x - y**2) * 10000//(2 * y + 1)

    #两部分加起来
    y = y * 10000 + m

    #缩小结果，把输出结果限制为放大一万倍
    if 1 <= input < 10:
        y //= 10000
    elif 10 <= input < 1000:
        y //= 1000
    elif 1000 <= input < 100000:
        y //= 100
    elif 100000 <= input < 10000000:
        y //= 10

    return y

#输入范围：[1,2147483647]，整数
#输出：放大一万倍的平方根，整数
n = 21
print(f"sqrt({n})*10000 = {int_sqrt(n)}")
